//* Задача 10: Напишите программу, которая принимает на вход трёхзначное число
//* и на выходе показывает вторую цифру этого числа.

// int showSecondNum(int number)
// {
//     int cutThird = number / 10;
//     int result = cutThird % 10;

//     return result;
// }

// Console.Write("Input 3-digit number: "); 
// int num = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine($"Second number of {num} is {showSecondNum(num)}");